OpenAtomFoundation/TobudOS/platform/vendor_bsp/gd/GD32F1x0_Firmware_Library_v3.1.0/GD32F1x0_standard_peripheral/Source/gd32f1x0_usart.c
    USART_CTL2(usart_periph) &= ~(USART_CTL2_IREN);
}

/*!
    \brief      IrDA low-power configure
    \param[in]  usart_periph: USARTx(x=0)
    \param[in]  irlp: IrDA low-power or normal
      \arg        USART_IRLP_LOW:    low-power
      \arg        USART_IRLP_NORMAL: normal
    \param[out] none
    \retval     none
*/
void usart_irda_lowpower_config(uint32_t usart_periph, uint32_t irlp)
{   
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    
    USART_CTL2(usart_periph) |= (USART_CTL2_IRLP & irlp);
}

/*!
    \brief      configure the peripheral clock prescaler in USART IrDA low-power mode or in USART SmartCard mode
    \param[in]  usart_periph: USARTx(x=0)
    \param[in]  psc: 0x00-0xFF
    \param[out] none
    \retval     none
*/
void usart_prescaler_config(uint32_t usart_periph, uint32_t psc)
{
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    
    USART_GP(usart_periph) &= ~(USART_GP_PSC);
    USART_GP(usart_periph) |= psc;
}

/*!
    \brief      configure hardware flow control RTS
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  rtsconfig: enable or disable RTS
      \arg        USART_RTS_ENABLE:  enable RTS
      \arg        USART_RTS_DISABLE: disable RTS
    \param[out] none
    \retval     none
*/
void usart_hardware_flow_rts_config(uint32_t usart_periph, uint32_t rtsconfig)
{
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(usart_periph) &= ~(USART_CTL2_RTSEN);
    USART_CTL2(usart_periph) |= rtsconfig;
}

/*!
    \brief      configure hardware flow control CTS
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  ctsconfig:  enable or disable CTS
      \arg        USART_CTS_ENABLE:  enable CTS
      \arg        USART_CTS_DISABLE: disable CTS
    \param[out] none
    \retval     none
*/
void usart_hardware_flow_cts_config(uint32_t usart_periph, uint32_t ctsconfig)
{
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(usart_periph) &= ~USART_CTL2_CTSEN;
    USART_CTL2(usart_periph) |= ctsconfig;
}

/*!
    \brief      RS485 driver enable
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void usart_rs485_driver_enable(uint32_t usart_periph)
{   
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    
    USART_CTL2(usart_periph) |= USART_CTL2_DEM;
}

/*!
    \brief      RS485 driver disable 
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void usart_rs485_driver_disable(uint32_t usart_periph)
{  
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    
    USART_CTL2(usart_periph) &= ~(USART_CTL2_DEM);
}

/*!
    \brief      driver enable assertion time configure
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  deatime: 0x00-0x1F
    \param[out] none
    \retval     none
*/
void usart_driver_assertime_config(uint32_t usart_periph, uint32_t deatime)
{
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    
    USART_CTL0(usart_periph) &= ~(USART_CTL0_DEA);
    USART_CTL0(usart_periph) |= (USART_CTL0_DEA & ((deatime) << 21));
}

/*!
    \brief      driver enable de-assertion time configure
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  dedtime: 0x00-0x1F
    \param[out] none
    \retval     none
*/
void usart_driver_deassertime_config(uint32_t usart_periph, uint32_t dedtime)
{
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    
    USART_CTL0(usart_periph) &= ~(USART_CTL0_DED);
    USART_CTL0(usart_periph) |= (USART_CTL0_DED & ((dedtime) << 16));
}

/*!
    \brief      configure driver enable polarity mode
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  dep: DE signal
      \arg        USART_DEP_HIGH: DE signal is active high 
      \arg        USART_DEP_LOW:  DE signal is active low
    \param[out] none
    \retval     none
*/
void usart_depolarity_config(uint32_t usart_periph, uint32_t dep)
{
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    /* reset DEP bit */
    USART_CTL2(usart_periph) &= ~(USART_CTL2_DEP);
    USART_CTL2(usart_periph) |= (USART_CTL2_DEP & dep);
}

/*!
    \brief      configure USART DMA reception
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  dmacmd: enable or disable DMA for reception
      \arg        USART_DENR_ENABLE:  DMA enable for reception
      \arg        USART_DENR_DISABLE: DMA disable for reception
    \param[out] none
    \retval     none
*/
void usart_dma_receive_config(uint32_t usart_periph, uint32_t dmacmd)
{
    USART_CTL2(usart_periph) &= ~USART_CTL2_DENR;
    /* configure DMA reception */
    USART_CTL2(usart_periph) |= dmacmd;
}

/*!
    \brief      configure USART DMA transmission
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  dmacmd: enable or disable DMA for transmission
      \arg        USART_DENT_ENABLE:  DMA enable for transmission
      \arg        USART_DENT_DISABLE: DMA disable for transmission
    \param[out] none
    \retval     none
*/
void usart_dma_transmit_config(uint32_t usart_periph, uint32_t dmacmd)
{
    USART_CTL2(usart_periph) &= ~USART_CTL2_DENT;
    /* configure DMA transmission */
    USART_CTL2(usart_periph) |= dmacmd;
}

/*!
    \brief      disable DMA on reception error
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void usart_reception_error_dma_disable(uint32_t usart_periph)
{
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(usart_periph) |= USART_CTL2_DDRE;
}

/*!
    \brief      enable DMA on reception error 
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void usart_reception_error_dma_enable(uint32_t usart_periph)
{
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(usart_periph) &= ~(USART_CTL2_DDRE);
}

/*!
    \brief      USART be able to wake up the MCU from deep-sleep mode
    \param[in]  usart_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void usart_wakeup_enable(uint32_t usart_periph)
{
    USART_CTL0(usart_periph) |= USART_CTL0_UESM;
}

/*!
    \brief      USART be not able to wake up the MCU from deep-sleep mode 
    \param[in]  usart_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void usart_wakeup_disable(uint32_t usart_periph)
{
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UESM);
}

/*!
    \brief      wakeup mode from deep-sleep mode
    \param[in]  usart_periph: USARTx(x=0)
    \param[in]  wum: wakeup mode 
      \arg        USART_WUM_ADDR:   WUF active on address match 
      \arg        USART_WUM_STARTB: WUF active on start bit
      \arg        USART_WUM_RBNE:   WUF active on RBNE  
    \param[out] none
    \retval     none
*/
void usart_wakeup_mode_config(uint32_t usart_periph, uint32_t wum)
{
    /* disable USART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    /* reset WUM bit */
    USART_CTL2(usart_periph) &= ~(USART_CTL2_WUM);    
    USART_CTL2(usart_periph) |= (USART_CTL2_WUM & (wum));
}

/*!
    \brief      get flag in STAT register
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  flag: flag type
      \arg        USART_FLAG_PERR:  parity error flag
      \arg        USART_FLAG_FERR:  frame error flag
      \arg        USART_FLAG_NERR:  noise error flag
      \arg        USART_FLAG_ORERR: overrun error
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_RBNE:  read data buffer not empty
      \arg        USART_FLAG_TC:    transmission completed
      \arg        USART_FLAG_TBE:   transmit data register empty
      \arg        USART_FLAG_LBD:  LIN break detected flag
      \arg        USART_FLAG_CTSF:  CTS change flag
      \arg        USART_FLAG_CTS:   CTS level
      \arg        USART_FLAG_RT:   receiver timeout flag
      \arg        USART_FLAG_EB:   end of block flag
      \arg        USART_FLAG_ABDE:  auto baudrate detection error
      \arg        USART_FLAG_ABD:  auto baudrate detection flag
      \arg        USART_FLAG_BSY:   busy flag
      \arg        USART_FLAG_AM:   address match flag
      \arg        USART_FLAG_SB:   send break flag
      \arg        USART_FLAG_RWU:   receiver wakeup from mute mode.
      \arg        USART_FLAG_WU:   wakeup from deep-sleep mode flag
      \arg        USART_FLAG_TEA:   transmit enable acknowledge flag
      \arg        USART_FLAG_REA:   receive enable acknowledge flag 
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus usart_flag_get(uint32_t usart_periph, usart_flag_enum flag)
{
    if(RESET != (USART_REG_VAL(usart_periph, flag) & BIT(USART_BIT_POS(flag)))){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear USART status
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  flag: flag type 
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise detected flag
      \arg        USART_FLAG_ORERR:overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_TC:   transmission complete flag
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_RT:  receiver timeout flag
      \arg        USART_FLAG_EB:  end of block flag
      \arg        USART_FLAG_AM:  address match flag
      \arg        USART_FLAG_WU:  wakeup from deep-sleep mode flag
    \param[out] none 
    \retval     none
*/
void usart_flag_clear(uint32_t usart_periph, usart_flag_enum flag)
{
    USART_INTC(usart_periph) |= BIT(USART_BIT_POS(flag));
}

/*!
    \brief      enable USART interrupt
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  inttype: interrupt type 
      \arg        USART_INT_IDLE: idle interrupt 
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and 
                                  overrun error interrupt enable interrupt 
      \arg        USART_INT_TC:   transmission complete interrupt   
      \arg        USART_INT_TBE:  transmit data register empty interrupt  
      \arg        USART_INT_PERR: parity error interrupt 
      \arg        USART_INT_AM:   address match interrupt    
      \arg        USART_INT_RT:   receiver timeout interrupt   
      \arg        USART_INT_EB:   end of block interrupt  
      \arg        USART_INT_LBD:  LIN break detection interrupt    
      \arg        USART_INT_ERR:  error interrupt enable in multibuffer communication  
      \arg        USART_INT_CTS:  CTS interrupt 
      \arg        USART_INT_WU:   wakeup from deep-sleep mode interrupt
    \param[out] none
    \retval     none
*/
void usart_interrupt_enable(uint32_t usart_periph, uint32_t inttype)
{
    USART_REG_VAL(usart_periph, inttype) |= BIT(USART_BIT_POS(inttype));
}

/*!
    \brief      disable USART interrupt
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  inttype: interrupt type 
      \arg        USART_INT_IDLE: idle interrupt 
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and 
                                  overrun error interrupt 
      \arg        USART_INT_TC:   transmission complete interrupt   
      \arg        USART_INT_TBE:  transmit data register empty interrupt  
      \arg        USART_INT_PERR: parity error interrupt 
      \arg        USART_INT_AM:   address match interrupt    
      \arg        USART_INT_RT:   receiver timeout interrupt   
      \arg        USART_INT_EB:   end of block interrupt  
      \arg        USART_INT_LBD:  LIN break detection interrupt    
      \arg        USART_INT_ERR:  error interrupt enable in multibuffer communication  
      \arg        USART_INT_CTS:  CTS interrupt 
      \arg        USART_INT_WU:   wakeup from deep-sleep mode interrupt   
    \param[out] none
    \retval     none
*/
void usart_interrupt_disable(uint32_t usart_periph, uint32_t inttype)
{
    USART_REG_VAL(usart_periph, inttype) &= ~BIT(USART_BIT_POS(inttype));
}

/*!
    \brief      enable USART command
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  cmdtype: command type 
      \arg        USART_CMD_ABDCMD: auto baudrate detection command 
      \arg        USART_CMD_SBKCMD: send break command
      \arg        USART_CMD_MMCMD:  mute mode command  
      \arg        USART_CMD_RXFCMD: receive data flush command 
      \arg        USART_CMD_TXFCMD: transmit data flush request
    \param[out] none
    \retval     none
*/
void usart_command_enable(uint32_t usart_periph, uint32_t cmdtype)
{
    USART_CMD(usart_periph) |= (cmdtype);
}

/*!
    \brief      get USART interrupt and flag status
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  int_flag: interrupt and flag type, refer to usart_interrupt_flag_enum
      \arg        USART_INT_FLAG_EB:   end of block interrupt and flag
      \arg        USART_INT_FLAG_RT:   receiver timeout interrupt and flag
      \arg        USART_INT_FLAG_AM:   address match interrupt and flag 
      \arg        USART_INT_FLAG_PERR: parity error interrupt and flag 
      \arg        USART_INT_FLAG_TBE:  transmitter buffer empty interrupt and flag 
      \arg        USART_INT_FLAG_TC:   transmission complete interrupt and flag
      \arg        USART_INT_FLAG_RBNE: read data buffer not empty interrupt and flag
      \arg        USART_INT_FLAG_RBNE_ORERR: read data buffer not empty interrupt and overrun error flag
      \arg        USART_INT_FLAG_IDLE: IDLE line detected interrupt and flag
      \arg        USART_INT_FLAG_LBD:  LIN break detected interrupt and flag 
      \arg        USART_INT_FLAG_WU:   wakeup from deep-sleep mode interrupt and flag
      \arg        USART_INT_FLAG_CTS:  CTS interrupt and flag
      \arg        USART_INT_FLAG_ERR_NERR:  error interrupt and noise error flag
      \arg        USART_INT_FLAG_ERR_ORERR: error interrupt and overrun error
      \arg        USART_INT_FLAG_ERR_FERR:  error interrupt and frame error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus usart_interrupt_flag_get(uint32_t usart_periph, uint32_t int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;
    /* get the interrupt enable bit status */
    intenable = (USART_REG_VAL(usart_periph, int_flag) & BIT(USART_BIT_POS(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (USART_REG_VAL2(usart_periph, int_flag) & BIT(USART_BIT_POS2(int_flag)));

    if(flagstatus && intenable){
        return SET;
    }else{
        return RESET; 
    }
}

/*!
    \brief      clear USART interrupt flag in STAT register
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  flag: USART interrupt flag
      \arg        USART_INT_FLAG_PERR: parity error flag
      \arg        USART_INT_FLAG_FERR: frame error flag
      \arg        USART_INT_FLAG_NERR: noise detected flag
      \arg        USART_INT_FLAG_ORERR:overrun error flag
      \arg        USART_INT_FLAG_IDLE: idle line detected flag
      \arg        USART_INT_FLAG_TC:   transmission complete flag
      \arg        USART_INT_FLAG_LBD:  LIN break detected flag
      \arg        USART_INT_FLAG_CTS:  CTS change flag
      \arg        USART_INT_FLAG_RT:   receiver timeout flag
      \arg        USART_INT_FLAG_EB:   end of block flag
      \arg        USART_INT_FLAG_AM:   address match flag
      \arg        USART_INT_FLAG_WU:   wakeup from deep-sleep mode flag
    \param[out] none
    \retval     none
*/
void usart_interrupt_flag_clear(uint32_t usart_periph, uint32_t flag)
{
    USART_INTC(usart_periph) |= BIT(USART_BIT_POS2(flag));
}
